dict1 = {'發燒': '耳鼻喉科', '胃痛': '消化內科', '胃潰瘍': '消化內科', '腹瀉': '消化內科', '高血壓': '心臟內科', '心悸': '心臟內科', '貧血': '血液腫瘤科',
         '氣喘': '胸腔內科', '泌尿道感染': '腎臟內科', '下肢水腫': '過敏免疫風濕科', '痛風': '過敏免疫風濕科', '糖尿病': '新陳代謝科', '青春痘': '新陳代謝科',
         '外傷': '一般外科', '痔瘡': '一般外科', '便秘': '一般外科', '疝氣': '一般外科', '體重過重': '代謝及減重外科', '多汗症': '神經外科', '胸痛': '心臟外科',
         '高血壓併發症': '心臟外科', '胸部外傷': '胸腔外科', '疝氣': '一般外科', '膽結石': '消化系外科', '胃食道逆流': '消化系外科', '脫臼': '骨科', '關節炎': '骨科',
         '駝背': '骨科', '脊椎側彎': '骨科', '不孕症': '婦產科', '近視': '眼科', '斜視': '眼科', '白內障': '眼科', '青光眼': '眼科', '感冒': '耳鼻喉科',
         '鼻塞': '耳鼻喉科', '鼻過敏': '耳鼻喉科', '鼻竇炎': '耳鼻喉科', '流鼻水': '耳鼻喉科', '耳鳴': '耳鼻喉科', '聲音沙啞': '耳鼻喉科', '暈眩': '耳鼻喉科',
         '灰指甲': '皮膚科', '禿髮': '皮膚科', '雀斑': '皮膚科', '蛀牙': '牙科', '缺牙': '牙科', '牙痛': '牙科', '失眠': '精神科', '焦慮症': '精神科',
         '躁鬱症': '精神科', '憂鬱症': '精神科'}
symptom_list = []
division_list = []
while True:
    symptom = input('請輸入症狀(如欲停止輸入,請輸入0):')

    if (symptom == '0'):
        break
    elif symptom in dict1:
        symptom_list.append(symptom)
        division_list.append(dict1[symptom])
    else:
        print('請撥打總機:(02) 2737-2181')

print('建議您看的科別:')

for i in range(len(symptom_list)):
    print('%s : %s' % (symptom_list[i], division_list[i]))